Tekla Open API Reference for Tekla Structures 2025
View.ViewDepthUp Property
The view depth up.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ViewDepthUp { get; set; }
Public Property ViewDepthUp As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace